app/controllers/user_movies_controller.rb

  def index
    user_movies = UserMovie.all
---
SELECT "user_movies".* FROM "user_movies"

  def show
    votes = UserMovie.find(params[:id])
---
SELECT "user_movies".* FROM "user_movies" WHERE "user_movies"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

    def set_user_movie
      user_movie = UserMovie.find(params[:id])
---
SELECT "user_movies".* FROM "user_movies" WHERE "user_movies"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]