app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
---
  def show
    current_user = User.find(session[:user_id])

INSERT INTO "users" ("username", "email", "year_born", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    user = User.create(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def set_user
      user = User.find(params[:id])